/**
 * Bible namespace, Bible chapter/verse statistics, Book names and abbreviations
 *
 * @license MIT/GLPv2
 * @author John Dyer (http://j.hn/)
 */

if (typeof window.bible == 'undefined')
	window.bible = {};

/**
 * @description OSIS book ID with chapter/verse statistics and English names
"

 */
bible.BOOK_DATA = {
	/*
	 Old Testament
	*/
	"Gen": {
		"chapters":[31,25,24,26,32,22,24,22,29,32,32,20,18,24,21,16,27,33,38,18,34,24,20,67,34,35,46,22,35,43,55,32,20,31,29,43,36,30,23,23,57,38,34,34,28,34,31,22,33,26],
		"names":{"eng":["Genesis","Ge","Gen"]}
	},
	"Exod": {
		"chapters":[22,25,22,31,23,30,25,32,35,29,10,51,22,31,27,36,16,27,25,26,36,31,33,18,40,37,21,43,46,38,18,35,23,35,35,38,29,31,43,38],
		"names":{"eng":["Exodus","Ex","Exo"]}
	},
	"Lev": {
		"chapters":[17,16,17,35,19,30,38,36,24,20,47,8,59,57,33,34,16,30,37,27,24,33,44,23,55,46,34],
		"names":{"eng":["Leviticus","Le","Lev"]}
	},
	"Num": {
		"chapters":[54,34,51,49,31,27,89,26,23,36,35,16,33,45,41,50,13,32,22,29,35,41,30,25,18,65,23,31,40,16,54,42,56,29,34,13],
		"names":{"eng":["Numbers","Nu","Num"]}
	},
	"Deut": {
		"chapters":[46,37,29,49,33,25,26,20,29,22,32,32,18,29,23,22,20,22,21,20,23,30,25,22,19,19,26,68,29,20,30,52,29,12],
		"names":{"eng":["Deuteronomy","Dt","Deut","Deu","De"]}
	},
	"Josh": {
		"chapters":[18,24,17,24,15,27,26,35,27,43,23,24,33,15,63,10,18,28,51,9,45,34,16,33],
		"names":{"eng":["Joshua","Js","Jos","Jos","Josh"]}
	},
	"Judg": {
		"chapters":[36,23,31,24,31,40,25,35,57,18,40,15,25,20,20,31,13,31,30,48,25],
		"names":{"eng":["Judges","Jg","Jdg","Jdgs"]}
	},
	"Ruth": {
		"chapters":[22,23,18,22],
		"names":{"eng":["Ruth","Ru","Rut"]}
	},
	"1Sam": {
		"chapters":[28,36,21,22,12,21,17,22,27,27,15,25,23,52,35,23,58,30,24,42,15,23,29,22,44,25,12,25,11,31,13],
		"names":{"eng":["1 Samuel","1S","1 Sam","1Sam","1 Sa","1Sa","I Samuel","I Sam","I Sa"]}
	},
	"2Sam": {
		"chapters":[27,32,39,12,25,23,29,18,13,19,27,31,39,33,37,23,29,33,43,26,22,51,39,25],
		"names":{"eng":["2 Samuel","2S","2 Sam","2Sam","2 Sa","2Sa","II Samuel","II Sam","II Sa","IIS"]}
	},
	"1Kgs": {
		"chapters":[53,46,28,34,18,38,51,66,28,29,43,33,34,31,34,34,24,46,21,43,29,53],
		"names":{"eng":["1 Kings","1K","1 Kin","1Kin","1 Ki","IK","1Ki","I Kings","I Kin","I Ki"]}
	},
	"2Kgs": {
		"chapters":[18,25,27,44,27,33,20,29,37,36,21,21,25,29,38,20,41,37,37,21,26,20,37,20,30],
		"names":{"eng":["2 Kings","2K","2 Kin","2Kin","2 Ki","IIK","2Ki","II Kings","II Kin","II Ki"]}
	},
	"1Chr": {
		"chapters":[54,55,24,43,26,81,40,40,44,14,47,40,14,17,29,43,27,17,19,8,30,19,32,31,31,32,34,21,30],
		"names":{"eng":["1 Chronicles","1Ch","1 Chr","1Chr","1 Ch","ICh","I Chronicles","I Chr","I Ch"]}
	},
	"2Chr": {
		"chapters":[17,18,17,22,14,42,22,18,31,19,23,16,22,15,19,14,19,34,11,37,20,12,21,27,28,23,9,27,36,27,21,33,25,33,27,23],
		"names":{"eng":["2 Chronicles","2Ch","2 Chr","2 Chr","2Chr","2 Ch","IICh","II Chronicles","II Chr","II Ch"]}
	},
	"Ezra": {
		"chapters":[11,70,13,24,17,22,28,36,15,44],
		"names":{"eng":["Ezra","Ezr"]}
	},
	"Neh": {
		"chapters":[11,20,32,23,19,19,73,18,38,39,36,47,31],
		"names":{"eng":["Nehemiah","Ne","Neh","Neh","Ne"]}
	},
	"Esth": {
		"chapters":[22,23,15,17,14,14,10,17,32,3],
		"names":{"eng":["Esther","Es","Est","Esth"]}
	},
	"Job": {
		"chapters":[22,13,26,21,27,30,21,22,35,22,20,25,28,22,35,22,16,21,29,29,34,30,17,25,6,14,23,28,25,31,40,22,33,37,16,33,24,41,30,24,34,17],
		"names":{"eng":["Job","Jb","Job"]}
	},
	"Ps": {
		"chapters":[6,12,8,8,12,10,17,9,20,18,7,8,6,7,5,11,15,50,14,9,13,31,6,10,22,12,14,9,11,12,24,11,22,22,28,12,40,22,13,17,13,11,5,26,17,11,9,14,20,23,19,9,6,7,23,13,11,11,17,12,8,12,11,10,13,20,7,35,36,5,24,20,28,23,10,12,20,72,13,19,16,8,18,12,13,17,7,18,52,17,16,15,5,23,11,13,12,9,9,5,8,28,22,35,45,48,43,13,31,7,10,10,9,8,18,19,2,29,176,7,8,9,4,8,5,6,5,6,8,8,3,18,3,3,21,26,9,8,24,13,10,7,12,15,21,10,20,14,9,6],
		"names":{"eng":["Psalm","Ps","Psa"]}
	},
	"Prov": {
		"chapters":[33,22,35,27,23,35,27,36,18,32,31,28,25,35,33,33,28,24,29,30,31,29,35,34,28,28,27,28,27,33,31],
		"names":{"eng":["Proverbs","Pr","Prov","Pro"]}
	},
	"Eccl": {
		"chapters":[18,26,22,16,20,12,29,17,18,20,10,14],
		"names":{"eng":["Ecclesiastes","Ec","Ecc", "Qohelet"]}
	},
	"Song": {
		"chapters":[17,17,11,16,16,13,13,14],
		"names":{"eng":["Song of Songs","So","Sos","Sng","Song of Solomon","SOS","SongOfSongs","SongofSolomon", "Canticle of Canticles"]}
	},
	"Isa": {
		"chapters":[31,22,26,6,30,13,25,22,21,34,16,6,22,32,9,14,14,7,25,6,17,25,18,23,12,21,13,29,24,33,9,20,24,17,10,22,38,22,8,31,29,25,28,28,25,13,15,22,26,11,23,15,12,17,13,12,21,14,21,22,11,12,19,12,25,24],
		"names":{"eng":["Isaiah","Is","Isa"]}
	},
	"Jer": {
		"chapters":[19,37,25,31,31,30,34,22,26,25,23,17,27,22,21,21,27,23,15,18,14,30,40,10,38,24,22,17,32,24,40,44,26,22,19,32,21,28,18,16,18,22,13,30,5,28,7,47,39,46,64,34],
		"names":{"eng":["Jeremiah","Je","Jer"]}
	},
	"Lam": {
		"chapters":[22,22,66,22,22],
		"names":{"eng":["Lamentations","La","Lam","Lament"]}
	},
	"Ezek": {
		"chapters":[28,10,27,17,17,14,27,18,11,22,25,28,23,23,8,63,24,32,14,49,32,31,49,27,17,21,36,26,21,26,18,32,33,31,15,38,28,23,29,49,26,20,27,31,25,24,23,35],
		"names":{"eng":["Ezekiel","Ek","Ezk","Ezek","Eze"]}
	},
	"Dan": {
		"chapters":[21,49,30,37,31,28,28,27,27,21,45,13],
		"names":{"eng":["Daniel","Da","Dan","Dl","Dnl"]}
	},
	"Hos": {
		"chapters":[11,23,5,19,15,11,16,14,17,15,12,14,16,9],
		"names":{"eng":["Hosea","Ho","Hos"]}
	},
	"Joel": {
		"chapters":[20,32,21],
		"names":{"eng":["Joel","Jl","Joel","Joe","Jol"]}
	},
	"Amos": {
		"chapters":[15,16,15,13,27,14,17,14,15],
		"names":{"eng":["Amos","Am","Amos","Amo"]}
	},
	"Obad": {
		"chapters":[21],
		"names":{"eng":["Obadiah","Ob","Oba","Obd","Odbh"]}
	},
	"Jonah": {
		"chapters":[17,10,10,11],
		"names":{"eng":["Jonah","Jh","Jon","Jnh"]}
	},
	"Mic": {
		"chapters":[16,13,12,13,15,16,20],
		"names":{"eng":["Micah","Mi","Mic"]}
	},
	"Nah": {
		"chapters":[15,13,19],
		"names":{"eng":["Nahum","Na","Nah","Nah","Na","Nam"]}
	},
	"Hab": {
		"chapters":[17,20,19],
		"names":{"eng":["Habakkuk","Hb","Hab","Hk","Habk"]}
	},
	"Zeph": {
		"chapters":[18,15,20],
		"names":{"eng":["Zephaniah","Zp","Zep","Zeph"]}
	},
	"Hag": {
		"chapters":[15,23],
		"names":{"eng":["Haggai","Ha","Hag","Hagg"]}
	},
	"Zech": {
		"chapters":[21,13,10,14,11,15,14,23,17,12,17,14,9,21],
		"names":{"eng":["Zechariah","Zc","Zech","Zec"]}
	},
	"Mal": {
		"chapters":[14,17,18,6],
		"names":{"eng":["Malachi","Ml","Mal","Mlc"]}
	},
	
	/*
	 New Testament
	*/	
	"Matt": {
		"chapters":[25,23,17,25,48,34,29,34,38,42,30,50,58,36,39,28,27,35,30,34,46,46,39,51,46,75,66,20],
		"names":{"eng":["Matthew","Mt","Matt","Mat"]}
	},
	"Mark": {
		"chapters":[45,28,35,41,43,56,37,38,50,52,33,44,37,72,47,20],
		"names":{"eng":["Mark","Mk","Mar","Mrk"]}
	},
	"Luke": {
		"chapters":[80,52,38,44,39,49,50,56,62,42,54,59,35,35,32,31,37,43,48,47,38,71,56,53],
		"names":{"eng":["Luke","Lk","Luk","Lu"]}
	},
	"John": {
		"chapters":[51,25,36,54,47,71,53,59,41,42,57,50,38,31,27,33,26,40,42,31,25],
		"names":{"eng":["John","Jhn","Jn","Joh","Jo"]}
	},
	"Acts": {
		"chapters":[26,47,26,37,42,15,60,40,43,48,30,25,52,28,41,40,34,28,41,38,40,30,35,27,27,32,44,31],
		"names":{"eng":["Acts","Ac","Act"]}
	},
	"Rom": {
		"chapters":[32,29,31,25,21,23,25,39,33,21,36,21,14,23,33,27],
		"names":{"eng":["Romans","Ro","Rom","Rmn","Rmns"]}
	},
	"1Cor": {
		"chapters":[31,16,23,21,13,20,40,13,27,33,34,31,13,40,58,24],
		"names":{"eng":["1 Corinthians","1Co","1 Cor","1Cor","ICo","1 Co","1Co","I Corinthians","I Cor","I Co"]}
	},
	"2Cor": {
		"chapters":[24,17,18,18,21,18,16,24,15,18,33,21,14],
		"names":{"eng":["2 Corinthians","2Co","2 Cor","2Cor","IICo","2 Co","2Co","II Corinthians","II Cor","II Co"]}
	},
	"Gal": {
		"chapters":[24,21,29,31,26,18],
		"names":{"eng":["Galatians","Ga","Gal","Gltns"]}
	},
	"Eph": {
		"chapters":[23,22,21,32,33,24],
		"names":{"eng":["Ephesians","Ep","Eph","Ephn"]}
	},
	"Phil": {
		"chapters":[30,30,21,23],
		"names":{"eng":["Philippians","Pp","Phi","Phil","Phi","Php"]}
	},
	"Col": {
		"chapters":[29,23,25,18],
		"names":{"eng":["Colossians","Co","Col","Colo","Cln","Clns"]}
	},
	"1Thess": {
		"chapters":[10,20,13,18,28],
		"names":{"eng":["1 Thessalonians","1Th","1 Thess","1Thess","ITh","1 Thes","1Thes","1 The","1The","1 Th","1Th","I Thessalonians","I Thess","I The","I Th"]}
	},
	"2Thess": {
		"chapters":[12,17,18],
		"names":{"eng":["2 Thessalonians","2Th","2 Thess","2 Thess","2Thess","IITh","2 Thes","2Thes","2 The","2The","2 Th","2Th","II Thessalonians","II Thess","II The","II Th"]}
	},
	"1Tim": {
		"chapters":[20,15,16,16,25,21],
		"names":{"eng":["1 Timothy","1Ti","1 Tim","1Tim","1 Ti","ITi","1Ti","I Timothy","I Tim","I Ti"]}
	},
	"2Tim": {
		"chapters":[18,26,17,22],
		"names":{"eng":["2 Timothy","2Ti","2 Tim","2 Tim","2Tim","2 Ti","IITi","2Ti","II Timothy","II Tim","II Ti"]}
	},
	"Titus": {
		"chapters":[16,15,15],
		"names":{"eng":["Titus","Ti","Tit","Tt","Ts"]}
	},
	"Phlm": {
		"chapters":[25],
		"names":{"eng":["Philemon","Phm","Phile","Phile","Philm","Pm"]}
	},
	"Heb": {
		"chapters":[14,18,19,16,14,20,28,13,28,39,40,29,25],
		"names":{"eng":["Hebrews","He","Heb","Hw"]}
	},
	"Jas": {
		"chapters":[27,26,18,17,20],
		"names":{"eng":["James","Jm","Jam","Jas","Ja"]}
	},
	"1Pet": {
		"chapters":[25,25,22,19,14],
		"names":{"eng":["1 Peter","1P","1 Pet","1Pet","IPe","1Pe","I Peter","I Pet","I Pe"]}
	},
	"2Pet": {
		"chapters":[21,22,18],
		"names":{"eng":["2 Peter","2P","2 Pet","2Pet","2Pe","IIP","II Peter","II Pet","II Pe"]}
	},
	"1John": {
		"chapters":[10,29,24,21,21],
		"names":{"eng":["1 John","1J","1 Jn","1Jn","1 Jo","IJo","I John","I Jo","I Jn"]}
	},
	"2John": {
		"chapters":[13],
		"names":{"eng":["2 John","2J","2 Jn","2Jn","2 Jo","IIJo","II John","II Jo","II Jn"]}
	},
	"3John": {
		"chapters":[14],
		"names":{"eng":["3 John","3J","3 Jn","3 Jn","3Jn","3 Jo","IIIJo","III John","III Jo","III Jn"]}
	},
	"Jude": {
		"chapters":[25],
		"names":{"eng":["Jude","Jud"]}
	},
	"Rev": {
		"chapters":[20,29,22,11,14,17,17,13,21,11,19,17,18,20,8,21,18,24,21,15,27,20],
		"names":{"eng":["Revelation","Re","Rev","Rvltn"]}
	},

	/*
	 Apocrypha
	*/	
	"Tob":{
		"chapters":[22,14,17,21,22,17,18],
		"names":{"eng":["Tobit"]}
	},
	"Jdt":{
		"chapters":[],
		"names":{"eng":["Judith"]}
	},
	"AddEsth":{
		"chapters":[],
		"names":{"eng":["Additions to Esther"]}
	},
	"Wis":{
		"chapters":[],
		"names":{"eng":["Wisdom", "Wisdom of Solomon"]}
	},
	"Sir":{
		"chapters":[],
		"names":{"eng":["Sirach","Ecclesiasticus"]}
	},
	"Bar":{
		"chapters":[],
		"names":{"eng":["Baruch"]}
	},
	"EpJer":{
		"chapters":[],
		"names":{"eng":["Letter of Jeremiah"]}
	},
	"PrAzar":{
		"chapters":[],
		"names":{"eng":["Prayer of Azariah"]}
	},
	"Sus":{
		"chapters":[],
		"names":{"eng":["Susanna"]}
	},
	"Bel":{
		"chapters":[],
		"names":{"eng":["Bel and the Dragon"]}
	},
	"1Macc":{
		"chapters":[],
		"names":{"eng":["1 Maccabees"]}
	},
	"2Macc":{
		"chapters":[],
		"names":{"eng":["2 Maccabees"]}
	},
	"3Macc":{
		"chapters":[],
		"names":{"eng":["3 Maccabees"]}
	},
	"4Macc":{
		"chapters":[],
		"names":{"eng":["4 Maccabees"]}
	},
	"PrMan":{
		"chapters":[],
		"names":{"eng":["Prayer of Manasseh", "Song of the Three Children"]}
	},
	"1Esd":{
		"chapters":[],
		"names":{"eng":["1 Esdras"]}
	},
	"2Esd":{
		"chapters":[],
		"names":{"eng":["2 Esdras","5 Ezra"]}
	},
	"Ps151":{
		"chapters":[],
		"names":{"eng":["Psalm"]}
	}
};

/**
 * @description Default order of Old Testament books
 */
bible.OT_BOOKS = ["Gen","Exod","Lev","Num","Deut","Josh","Judg","Ruth","1Sam","2Sam","1Kgs","2Kgs","1Chr","2Chr","Ezra","Neh","Esth","Job","Ps","Prov","Eccl","Song","Isa","Jer","Lam","Ezek","Dan","Hos","Joel","Amos","Obad","Jonah","Mic","Nah","Hab","Zeph","Hag","Zech","Mal"];

/**
 * @description Default order of New Testament books
 */
bible.NT_BOOKS = ["Matt","Mark","Luke","John","Acts","Rom","1Cor","2Cor","Gal","Eph","Phil","Col","1Thess","2Thess","1Tim","2Tim","Titus","Phlm","Heb","Jas","1Pet","2Pet","1John","2John","3John","Jude","Rev"];

/**
 * @description Default order of Apocryphal books
 */
bible.AP_BOOKS = ["Tob","Jdt","AddEsth","Wis","Sir","Bar","EpJer","PrAzar","Sus","Bel","1Macc","2Macc","3Macc","4Macc","1Esd","2Esd","Ps151"];

/**
 * @description Default order of Apocryphal books
 */
bible.DEFAULT_BIBLE = bible.OT_BOOKS.concat(bible.NT_BOOKS);

/**
 * @description Default order of Bible's with Apocryphal books
 */
bible.APOCRYPHAL_BIBLE = bible.OT_BOOKS.concat(bible.AP_BOOKS, bible.NT_BOOKS);


/**
 * @description Adds names in bulk for a language
 */
bible.addNames = function(lang, bookList, namesData) {
	for (var i in bookList) {
		var osisKey = bookList[i],
			names = namesData[i];
			
		if (typeof names === 'string')
			bible.BOOK_DATA[ osisKey ].names[lang] = [names];
		else
			bible.BOOK_DATA[ osisKey ].names[lang] = names;
	}
}

// Arabic
bible.addNames('ara', bible.DEFAULT_BIBLE, [
"التكوين","الخروج","اللاويين","العدد","التثنية","يشوع","القضاة","راعوث","صموئيل الأول","صموئيل الثاني","الملوك الأول","الملوك الثاني","أخبار الأيام الأول","أخبار الأيام الثاني","عزرا","نحميا","أستير","أيوب","المزامير","الأمثال","الجامعة","نشيد الأنشاد","أشعياء","أرمياء","مراثي أرمياء","حزقيال","دانيال","هوشع","يوئيل","عاموس","عوبديا","يونان","ميخا","ناحوم","حبقوق","صفنيا","حجي","زكريا","ملاخي","متى","مرقس","لوقا","يوحنا","أعمال الرسل","رومية","1 كورنثوس","2 كورنثوس","غلاطية","أفسس","فيليبي","كولوسي","1 تسالونيكي","2 تسالونيكي","1 تيموثاوس","2 تيموثاوس","تيطس","فيليمون","العبرانيين","يعقوب","1 بطرس","2 بطرس","1 يوحنا","2 يوحنا","3 يوحنا","يهوذا","رؤيا"
]);

// Bengali
bible.addNames('ben', bible.DEFAULT_BIBLE, [
"আদিপুস্তক","যাত্রাপুস্তক","লেবীয় পুস্তক","গণনাপুস্তক","দ্বিতীয় বিবরণ","যিহোশূয়","বিচারকর্তৃগণ","রূত","১ শমূয়েল","২ শমূয়েল","১ রাজাবলি","২ রাজাবলি","১ বংশাবলি","২ বংশাবলি","ইষ্রা","নহিমিয়","ইষ্টের","ইয়োব","গীতসংহিতা","হিতোপদেশ","উপদেশক","পরমগীত","যিশাইয়","যিরমিয়","বিলাপ","যিহিষ্কেল","দানিয়েল","হোশেয়","যোয়েল","আমোষ","ওবদিয়","যোনা","মীখা","নহূম","হবক্কূক","সফনিয়","হগয়","সখরিয়","মালাখি","মথি","মার্ক","লূক","যোহন","প্রেরিত্","রোমীয়","১ করিন্থীয়","২ করিন্থীয়","গালাতীয়","ইফিষীয়","ফিলিপীয়","কলসীয়","১ থিষলনীকীয়","২ থিষলনীকীয়","১ তীমথিয়","২ তীমথিয়","তীত","ফিলীমন","ইব্রীয়","যাকোব","১ পিতর","২ পিতর","১ যোহন","২ যোহন","৩ যোহন","যিহূদা","প্রকাশিত বাক্য"
]);

// Burmese
bible.addNames("bur",bible.DEFAULT_BIBLE,[
"ကမၻာဦးက်မ္း  ","ထြက္ေျမာက္ရာက်မ္း  ","ဝတ္ျပဳရာက်မ္း  ","ေတာလည္ရာက်မ္း  ","တရားေဟာရာက်မ္း   ","ေယာရႈမွတ္စာ  ","တရားသူႀကီးမွတ္စာ   ","ရုသဝတၳဳ   ","ဓမၼရာဇဝင္ပဌမေစာင္   ","ဓမၼရာဇဝင္ဒုတိယေစာင္   ","ဓမၼရာဇဝင္တတိယေစာင္ ","ဓမၼရာဇဝင္စတုတၳေစာင္   ","ရာဇဝင္ခ်ဳပ္ပဌမေစာင္   ","ရာဇဝင္ခ်ဳပ္ဒုတိယေစာင္   ","ဧဇရမွတ္စာ  ","ေနဟမိမွတ္စာ   ","ဧသတာဝတၱဳ   ","ေယာဘဝတၱဳ   ","ဆာလံက်မ္း   ","သုတၱံက်မ္း   ","ေဒသနာက်မ္း   ","ေရွာလမုန္သီခ်င္း   ","ေဟရွာယအနာဂတိၱက်မ္း   ","ေယရမိအနာဂတၱိက်မ္း   ","ေယရမိျမည္တမ္းစကား   ","ေယဇေက်လအနာကတၱိက်မ္း   ","ဒံေယလအနာဂတၱိက်မ္း   ","ေဟာေရွအနာဂတၱိက်မ္း   ","ေယာလအနာဂတၱိက်မ္း   ","အာမုတ္အနာဂတၱိက်မ္း   ","ၾသဗဒိဗ်ာဒိတ္ရူပါရုံ   ","ေယာနဝတၳဳ   ","မိကၡာအနာဂတၱိက်မ္း   ","နာဟံုအနာဂတၱိက်မ္း   ","ဟဗကၠဳတ္အနာဂတၱိက်မ္း   ","ေဇဖနိအနာဂတၱိက်မ္း   ","ဟဂၢဲအနာဂတၱိက်မ္း   ","ဇာခရိအနာဂတၱိက်မ္း   ","မာလခိအနာဂတၱိက်မ္း   ","ရွင္မႆဲခရစ္ဝင္   ","ရွင္မာကုခရစ္ဝင္   ","ရွင္လုကာခရစ္ဝင္   ","ရွင္ေယာဟန္ခရစ္ဝင္   ","တမန္ေတာ္ဝတၳဳ   ","ေရာမၾသဝါဒစာ   ","ေကာရိ ႏၱဳ ၾသဝါဒစာပဌမေစာင္  ","ေကာရိ သု ၾသဝါဒစာဒုတိယေစာင္   ","ဂလာတိၾသဝါဒစာ   ","ဧဖက္ၾသဝါဒစာ   ","ဖိလိပၸိၾသဝါဒစာ   ","ေကာေလာသဲၾသဝါဒစာ   ","သက္သာေလာနိတ္ၾသဝါဒစာပဌမေစာင္   ","သက္သာေလာနိတ္ၾသဝါဒစာဒုတိယေစာင္   ","တိေမာေသၾသဝါဒပဌမေစာင္   ","တိေမာေသၾသဝါဒစာဒုတိယေစာင္   ","တိတုၾသဝါဒစာ   ","ဖိေလမုန္ၾသဝါဒစာ   ","ေဟျဗဲၾသဝါဒစာ   ","ရွင္ယာကုပ္ၾသဝါဒစာ   ","ရွင္ေပတရုၾသဝါဒစာပဌမေစာင္   ","ရွင္ေပတရုၾသဝါဒစာဒုတိယေစာင္   ","ရွင္ေယာဟန္ၾသဝါဒစာပဌမေစာင္    ","ရွင္ေယာဟန္ၾသဝါဒစာဒုတိယေစာင္    ","ရွင္ေယာဟန္ၾသဝါဒစာတတိယေစာင္   ","ရွင္ယုဒၾသဝါဒစာ   ","ဗ်ာဒိတ္က်မ္း   "
]);

// Chinese (Simplified)
bible.addNames('chi', bible.DEFAULT_BIBLE, [
"創 世 記","出 埃 及 記","利 未 記","民 數 記","申 命 記","約 書 亞 記","士 師 記","路 得 記","撒 母 耳 記 上","撒 母 耳 記 下","列 王 紀 上","列 王 紀 下","歷 代 志 上","歷 代 志 下","以 斯 拉 記","尼 希 米 記","以 斯 帖 記","約 伯 記","詩 篇","箴 言","傳 道 書","雅 歌","以 賽 亞 書","耶 利 米 書","耶 利 米 哀 歌","以 西 結 書","但 以 理 書","何 西 阿 書","約 珥 書","阿 摩 司 書","俄 巴 底 亞 書","約 拿 書","彌 迦 書","那 鴻 書","哈 巴 谷 書","西 番 雅 書","哈 該 書","撒 迦 利 亞","瑪 拉 基 書","馬 太 福 音","馬 可 福 音","路 加 福 音","約 翰 福 音","使 徒 行 傳","羅 馬 書","歌 林 多 前 書","歌 林 多 後 書","加 拉 太 書","以 弗 所 書","腓 立 比 書","歌 羅 西 書","帖 撒 羅 尼 迦 前 書","帖 撒 羅 尼 迦 後 書","提 摩 太 前 書","提 摩 太 後 書","提 多 書","腓 利 門 書","希 伯 來 書","雅 各 書","彼 得 前 書","彼 得 後 書","約 翰 一 書","約 翰 二 書","約 翰 三 書","猶 大 書","启 示 录"
]);

// Chinese (Traditional)
bible.addNames('zho', bible.DEFAULT_BIBLE, [
"創 世 記","出 埃 及 記","利 未 記","民 數 記","申 命 記","約 書 亞 記","士 師 記","路 得 記","撒 母 耳 記 上","撒 母 耳 記 下","列 王 紀 上","列 王 紀 下","歷 代 志 上","歷 代 志 下","以 斯 拉 記","尼 希 米 記","以 斯 帖 記","約 伯 記","詩 篇","箴 言","傳 道 書","雅 歌","以 賽 亞 書","耶 利 米 書","耶 利 米 哀 歌","以 西 結 書","但 以 理 書","何 西 阿 書","約 珥 書","阿 摩 司 書","俄 巴 底 亞 書","約 拿 書","彌 迦 書","那 鴻 書","哈 巴 谷 書","西 番 雅 書","哈 該 書","撒 迦 利 亞","瑪 拉 基 書","馬 太 福 音","馬 可 福 音","路 加 福 音","約 翰 福 音","使 徒 行 傳","羅 馬 書","歌 林 多 前 書","歌 林 多 後 書","加 拉 太 書","以 弗 所 書","腓 立 比 書","歌 羅 西 書","帖 撒 羅 尼 迦 前 書","帖 撒 羅 尼 迦 後 書","提 摩 太 前 書","提 摩 太 後 書","提 多 書","腓 利 門 書","希 伯 來 書","雅 各 書","彼 得 前 書","彼 得 後 書","約 翰 一 書","約 翰 二 書","約 翰 三 書","猶 大 書","启 示 录"
]);

// French
bible.addNames("fre",bible.DEFAULT_BIBLE,[
"Genèse","Exode","Lévitique","Nombres","Deutéronome","Josué","Juges","Ruth","1 Samuel","2 Samuel","1 Rois","2 Rois","1 Chroniques","2 Chroniques","Esdras","Néhémie","Esther","Job","Psaumes","Proverbes","Ecclésiaste","Cantique","Esaïe","Jérémie","Lamentations","Ezéchiel","Daniel","Osée","Joël","Amos","Abdias","Jonas","Michée","Nahum","Habacuc","Sophonie","Aggée","Zacharie","Malachie","Matthieu","Marc","Luc","Jean","Actes","Romains","1 Corinthiens","2 Corinthiens","Galates","Ephésiens","Philippiens","Colossiens","1 Thessalonicien","2 Thessalonicien","1 Timothée","2 Timothée","Tite","Philemon","Hébreux","Jacques","1 Pierre","2 Pierre","1 Jean","2 Jean","3 Jean","Jude","Apocalypse"
]);

// German
bible.addNames("de",bible.DEFAULT_BIBLE,[
"Genesis","Exodus","Levitikus","Numeri","Deuteronomium","Josua","Richter","Rut","1 Samuel","2 Samuel","1 Könige","2 Könige","1 Chronik","2 Chronik","Esra","Nehemia","Ester",["Hiob","Ijob"],"Psalter","Sprichwörter","Kohelet","Hohelied Salmos","Jesaja","Jeremia",["Klagelieder","Jeremias"],["Hesekiel","Ezechiel"],"Daniel","Hosea","Joel","Amos","Obadja","Jona","Micha","Nahum","Habakuk","Zefanja","Haggai","Sacharja","Maleachi","Matthäus","Markus","Lukas","Johannes","Apostelgeschichte des Lukas","Römer","1 Korinther","2 Korinther","Galater","Epheser","Philipper","Kolosser","1 Thessalonicher","2 Thessalonicher","1 Timotheus","2 Timotheus","Titus","Philemon","Hebräer","Jakobus","1 Petrus","2 Petrus","1 Johannes","2 Johannes","3 Johannes","Judas","Offenbarung des Johannes"
]);

// Gujarati
bible.addNames('guj', bible.DEFAULT_BIBLE, [
"ઉત્પત્તિ","નિર્ગમન","લેવીય","ગણના","યહોશુઆ","પુનર્નિયમ","ન્યાયાધીશો","રૂથ","૧ શમુએલનું","૨ શમુએલનું","૧ રાજાઓનું","૨ રાજાઓનું","૧ કાળવૃત્તાંતનું","૨ કાળવૃત્તાંતનું","એઝરા","નહેમ્યા","એસ્તેર","અયૂબ","ગીતશાસ્ત્ર","નીતિવચનો","સભાશિક્ષક","ગીતોનું ગીત","યશાયા","યર્મિયા","યર્મિયાનો વિલાપ","હઝકિયેલ","દાનિયેલ","હોશિયા","યોએલ","ઓબાદ્યા","યૂના","આમોસ","નાહૂમ","મિખાહ","હબાક્કુક","હાગ્ગાય","સફાન્યા","માલાખી","ઝખાર્યા","માર્ક","માથ્થી","લૂક","યોહાન","પ્રેરિતોનાં કૃત્યો","રોમનો","૧ કરિંથીઓ","૨ કરિંથીઓ","ગલાતીઓ","ફિલિપ્પીઓ","એફેસીઓ","કલોસ્સીઓ","૧ થેસ્સલોનિકીઓ","૨ થેસ્સલોનિકીઓ","તિતસ","૧ તિમોથી","૨ તિમોથી","ફિલેમોન","યાકૂબ","૧ પિતર","હિબ્રૂઓ","૨ પિતર","૧ યોહાન","૨ યોહાન","૩ યોહાન","યહુદા","પ્રકટીકરણn"
]);

// Greek
bible.addNames("gre", bible.DEFAULT_BIBLE, [
"ΓΕΝΕΣΙΣ","ΕΞΟΔΟΣ","ΛΕΥΙΤΙΚΟΝ","ΑΡΙΘΜΟΙ","ΔΕΥΤΕΡΟΝΟΜΙΟΝ","ΙΗΣΟΥΣ ΝΑΥΗ","ΚΡΙΤΑΙ","ΡΟΥΘ","ΒΑΣΙΛΕΙΩΝ Α΄","ΒΑΣΙΛΕΙΩΝ B΄","ΒΑΣΙΛΕΙΩΝ Γ΄","ΒΑΣΙΛΕΙΩΝ Δ΄","ΠΑΡΑΛΕΙΠΟΜΕΝΩΝ Α΄","ΠΑΡΑΛΕΙΠΟΜΕΝΩΝ B΄","ΕΣΔΡΑΣ","ΝΕΕΜΙΑΣ","ΕΣΘΗΡ","ΙΩΒ","ΨΑΛΜΟΙ","ΠΑΡΟΙΜΙΑΙ","ΕΚΚΛΗΣΙΑΣΤΗΣ","ΑΣΜΑ ΑΣΜΑΤΩΝ","ΗΣΑΪΑΣ","ΙΕΡΕΜΙΑΣ","ΘΡΗΝΟΙ ΙΕΡΕΜΙΟΥ","ΙΕΖΕΚΙΗΛ ","ΔΑΝΙΗΛ","ΩΣΗΕ","ΙΩΗΛ","ΑΜΩΣ","ΟΒΔΙΟΥ","ΙΩΝΑΣ","ΜΙΧΑΙΑΣ","ΝΑΟΥΜ","ΑΜΒΑΚΟΥΜ","ΣΟΦΟΝΙΑΣ ","ΑΓΓΑΙΟΣ","ΖΑΧΑΡΙΑΣ","ΜΑΛΑΧΙΑΣ","ΚΑΤΑ ΜΑΤΘΑΙΟΝ","ΚΑΤΑ ΜΑΡΚΟΝ","ΚΑΤΑ ΛΟΥΚΑΝ","ΚΑΤΑ ΙΩΑΝΝΗΝ","ΠΡΑΞΕΙΣ","ΠΡΟΣ ΡΩΜΑΙΟΥΣ","ΠΡΟΣ ΚΟΡΙΝΘΙΟΥΣ Α΄","ΠΡΟΣ ΚΟΡΙΝΘΙΟΥΣ Β΄","ΠΡΟΣ ΓΑΛΑΤΑΣ","ΠΡΟΣ ΕΦΕΣΙΟΥΣ","ΠΡΟΣ ΦΙΛΙΠΠΗΣΙΟΥΣ","ΠΡΟΣ ΚΟΛΟΣΣΑΕΙΣ","ΘΕΣΣΑΛΟΝΙΚΕΙΣ Α΄","ΘΕΣΣΑΛΟΝΙΚΕΙΣ Β΄","ΠΡΟΣ ΤΙΜΟΘΕΟΝ Α΄","ΠΡΟΣ ΤΙΜΟΘΕΟΝ Β΄","ΠΡΟΣ ΤΙΤΟΝ","ΠΡΟΣ ΦΙΛΗΜΟΝΑ","ΠΡΟΣ ΕΒΡΑΙΟΥΣ","ΙΑΚΩΒΟΥ","ΠΕΤΡΟΥ Α΄","ΠΕΤΡΟΥ Β΄","ΙΩΑΝΝΟΥ Α΄","ΙΩΑΝΝΟΥ Β΄","ΙΩΑΝΝΟΥ Γ΄","ΙΟΥΔΑ","ΑΠΟΚΑΛΥΨΙΣ ΙΩΑΝΝΟΥ"
]);

// Hebrew
bible.addNames("heb", bible.OT_BOOKS, [
	"בראשית","שמות","ויקרא","במדבר","דברים","יהושע","שופטים","רות","שמואל א","שמואל ב","מלכים א","מלכים ב","דברי הימים א","דברי הימים ב","עזרא","נחמיה","אסתר","איוב","תהילים","קהלת","קהלת","שיר השירים","ישעה","ירמיה","איכה","יחזקאל","דניאל","הושע","יואל","עמוס","עבדיה","יונה","מיכה","נחום","חבקוק","צפניה","חגי","זכריה","מלאכי"
]);

//Hindi
bible.addNames("hin", bible.DEFAULT_BIBLE, [
"उत्पत्ति","निर्गमन","लैव्यवस्था","गिनती","व्यवस्थाविवरण","यहोशू","न्यायियों","रूत","1 शमूएल","2 शमूएल","1 राजा","2 राजा","1 इतिहास","2 इतिहास","एज्रा","नहेमायाह","एस्तेर","अय्यूब","भजन संहिता","नीतिवचन","सभोपदेशक","श्रेष्ठगीत","श्रेष्ठगीत","यिर्मयाह","विलापगीत","यहेजकेल","दानिय्येल","होशे","योएल","आमोस","ओबद्दाह","योना","मीका","नहूम","हबक्कूक","सपन्याह","हाग्गै","जकर्याह","मलाकी","मत्ती","मरकुस","लूका","यूहन्ना","प्रेरितों के काम","रोमियो","1 कुरिन्थियों","2 कुरिन्थियों","गलातियों","इफिसियों","फिलिप्पियों","कुलुस्सियों","1 थिस्सलुनीकियों","2 थिस्सलुनीकियों","1 तीमुथियुस","2 तीमुथियुस","तीतुस","फिलेमोन","इब्रानियों","याकूब","1 पतरस","2 पतरस","1 यूहन्ना","2 यूहन्ना","3 यूहन्ना","यहूदा","प्रकाशित वाक्य"
]);

//Indonesian
bible.addNames("ind", bible.DEFAULT_BIBLE, [
"Kejadian","Keluaran","Imamat","Bilangan","Ulangan","Yosua","Hakim-hakim","Rut","1 Samuel","2 Samuel","1 Raja-raja","2 Raja-raja","1 Tawarikh","2 Tawarikh","Esra","Nehemia","Ester","Ayub","Mazmur","Amsal","Pengkhotbah","Kidung Agung","Yesaya","Yeremia","Ratapan","Yehezkiel","Daniel","Hosea","Yoël","Amos","Obaja","Yunus","Mikha","Nahum","Habakuk","Zefanya","Hagai","Zakharia","Maleakhi","Matius","Markus","Lukas","Yohanes","Kisah Rasul-rasul","Roma","1 Korintus","2 Korintus","Galatia","Efesus","Filipi","Kolose","1 Tesalonika","2 Tesalonika","1 Timotius","2 Timotius","Titus","Filemon","Ibrani","Yakobus","1 Petrus","2 Petrus","1 Yohanes","2 Yohanes","3 Yohanes","Yudas","Wahyu"
]);

//Kannada
bible.addNames("kan", bible.DEFAULT_BIBLE, [
"ಆದಿಕಾಂಡ","ವಿಮೋಚನಕಾಂಡ","ಯಾಜಕಕಾಂಡ","ಅರಣ್ಯಕಾಂಡ","ಧರ್ಮೋಪದೇಶಕಾಂಡ","ಯೆಹೋಶುವನು","ನ್ಯಾಯಸ್ಥಾಪಕರು","ರೂತಳು","೧ ಸಮುವೇಲನು","೨ ಸಮುವೇಲನು","೧ ರಾಜರುಗಳು","೨ ರಾಜರುಗಳು","೧ ಪೂರ್ವಕಾಲವೃತ್ತಾಂತ","೨ ಪೂರ್ವಕಾಲವೃತ್ತಾಂತ","ಎಜ್ರ","ನೆಹೆಮೀಯ","ಎಸ್ತೇರಳು","ಯೋಬನು","ಕೀರ್ತನೆಗಳು","ಜ್ಞಾನೋಕ್ತಿಗಳು","ಪ್ರಸಂಗಿ","ಪರಮ ಗೀತ","ಯೆಶಾಯ","ಯೆರೆಮೀಯ","ಪ್ರಲಾಪಗಳು","ಯೆಹೆಜ್ಕೇಲ","ದಾನಿಯೇಲ","ಹೋಶೇಯ","ಯೋವೇಲ","ಆಮೋಸ","ಒಬದ್ಯ","ಯೋನ","ಮೀಕ","ನಹೂಮ","ಹಬಕ್ಕೂಕ","ಚೆಫನ್ಯ","ಹಗ್ಗಾಯ","ಜೆಕರ್ಯ","ಮಲಾಕಿ","ಮತ್ತಾಯ","ಮಾರ್ಕ","ಲೂಕ","ಯೋಹಾನ","ಅಪೊಸ್ತಲರ ಕಾರ್ಯಗಳು","ರೋಮ್‌ನಗರದವರಿಗೆ","೧ ಕೊರಿಂಥದವರಿಗೆ","೨ ಕೊರಿಂಥದವರಿಗೆ","ಗಲಾತ್ಯದವರಿಗೆ","ಎಫೆಸದವರಿಗೆ","ಫಿಲಿಪ್ಪಿಯವರಿಗೆ","ಕೊಲೊಸ್ಸೆಯವರಿಗೆ","೧ ಥೆಸಲೋನಿಕದವರಿಗೆ","೨ ಥೆಸಲೋನಿಕದವರಿಗೆ","೧ ತಿಮೊಥೆಯನಿಗೆ","೨ ತಿಮೊಥೆಯನಿಗೆ","ತೀತನಿಗೆ","ಫಿಲೆಮೋನನಿಗೆ","ಇಬ್ರಿಯರಿಗೆ","ಯಾಕೋಬನು","೧ ಪೇತ್ರನು","೨ ಪೇತ್ರನು","೧ ಯೋಹಾನ","೨ ಯೋಹಾನ","೩ ಯೋಹಾನ","ಯೂದನು","ಪ್ರಕಟನೆ"
]);

//Korean
bible.addNames("kor", bible.DEFAULT_BIBLE, [
"창세기","출애굽기","레위기","민수기","신명기","여호수아","사사기","룻기","사무엘상","사무엘하","열왕기상","열왕기하","역대상","역대하","에스라","느헤미야","에스더","욥기","시편","잠언","전도서","아가","이사야","예레미야","예레미야애가","에스겔","다니엘","호세아","요엘","아모스","오바댜","요나","미가","나훔","하박국","스바냐","학개","스가랴","말라기","마태복음","마가복음","누가복음","요한복음","사도행전","로마서","고린도전서","고린도후서","갈라디아서","에베소서","빌립보서","골로새서","데살로니가전서","데살로니가후서","디모데전서","디모데후서","디도서","빌레몬서","히브리서","야고보서","베드로전서","베드로후서","요한일서","요한이서","요한삼서","유다서","요한계시록"
]);

//Malayalam
bible.addNames("mal", bible.DEFAULT_BIBLE, [
"ഉല്പത്തി","പുറപ്പാടു്","ലേവ്യപുസ്തകം","സംഖ്യാപുസ്തകം","ആവർത്തനം","യോശുവ","ന്യായാധിപന്മാർ","രൂത്ത്","ശമൂവേൽ-1","ശമൂവേൽ-2","രാജാക്കന്മാർ 1","രാജാക്കന്മാർ 2","ദിനവൃത്താന്തം 1","ദിനവൃത്താന്തം 2","എസ്രാ","നെഹെമ്യാവു","എസ്ഥേർ","ഇയ്യോബ്","സങ്കീർത്തനങ്ങൾ","സദൃശ്യവാക്യങ്ങൾ","സഭാപ്രസംഗി","ഉത്തമ ഗീതം","യെശയ്യാ","യിരേമ്യാവു","വിലാപങ്ങൾ","യേഹേസ്കേൽ","ദാനീയേൽ","ഹോശേയ","യോവേൽ","ആമോസ്","ഓബദ്യാവു","യോനാ","മീഖാ","നഹൂം","ഹബക്കൂക്‍","സെഫന്യാവു","ഹഗ്ഗായി","സെഖർയ്യാവു","മലാഖി","മത്തായി","മർക്കൊസ്","ലൂക്കോസ്","യോഹന്നാൻ","പ്രവൃത്തികൾ","റോമർ","കൊരിന്ത്യർ 1","കൊരിന്ത്യർ 2","ഗലാത്യർ","എഫെസ്യർ","ഫിലിപ്പിയർ","കൊലൊസ്സ്യർ","തെസ്സലൊനീക്യർ 1","തെസ്സലൊനീക്യർ 2","തിമൊഥെയൊസ് 1","തിമൊഥെയൊസ് 2","തീത്തൊസ്","ഫിലേമോൻ","എബ്രായർ","യാക്കോബ്","പത്രൊസ് 1","പത്രൊസ് 2","യോഹന്നാൻ 1","യോഹന്നാൻ 2","യോഹന്നാൻ 3","യൂദാ","വെളിപ്പാടു"
]);

//Marathi
bible.addNames("mar", bible.DEFAULT_BIBLE, [
"उत्पत्ति","निर्गम","लेवीय","गणना","अनुवाद","यहोशवा","शास्ते","रूथ","1 शमुवेल","2 शमुवेल","1 राजे","2 राजे","1 इतिहास","2 इतिहास","एज्रा","नहेम्या","एस्तेर","ईयोब","स्तोत्रसंहिता","नीतिसूत्रे","उपदेशक","गीतरत्न","यशया","यिर्मया","विलापगीत","यहेज्केल","दानीएल","होशेय","योएल","आमोस","ओबद्या","योना","मीखा","नहूम","हबक्कूक","सफन्या","हाग्गय","जखऱ्या","मलाखी","मत्तय","मार्क","लूक","योहान","प्रेषितांचीं कृत्यें","रोमकरांस","1 करिंथकरांस","2 करिंथकरांस","गलतीकरांस","इफिसकरांस","फिलिप्पैकरांस","कलस्सैकरांस","1 थेस्सलनीकाकरांस","2 थेस्सलनीकाकरांस","1 तीमथ्याला","2 तीमथ्थाला","तीताला","फिलेमोना","इब्री लोकांस","याकोब","1 पेत्र","2 पेत्र","1 योहान","2 योहान","3 योहान","यहूदा","प्रकटीकरण"
]);

//Malaysian
bible.addNames("mys", bible.DEFAULT_BIBLE, [
"Kejadian","Keluaran","Imamat","Bilangan","Ulangan","Yosua","Hakim-hakim","Rut","1 Samuel","2 Samuel","1 Raja-raja","2 Raja-raja","1 Tawarikh","2 Tawarikh","Ezra","Nehemia","Ester","Ayub","Mazmur","Amsal","Pengkhotbah","Kidung Agung","Yesaya","Yeremia","Ratapan","Yehezkiel","Daniel","Hosea","Yoel","Amos","Obaja","Yunus","Mikha","Nahum","Habakuk","Zefanya","Hagai","Zakaria","Maleakhi","Matius","Markus","Lukas","Yohanes","Kisah Para Rasul","Roma","1 Korintus","2 Korintus","Galatia","Efesus","Filipi","Kolose","1 Tesalonika","2 Tesalonika","1 Timotius","2 Timotius","Titus","Filemon","Ibrani","Yakobus","1 Petrus","2 Petrus","1 Yohanes","2 Yohanes","3 Yohanes","Yudas","Wahyun"
]);

//Napali
bible.addNames("nap", bible.DEFAULT_BIBLE, [
"उत्पत्ति","प्रस्थान","लेवी","गन्ती","व्यवस्था","यहोशू","न्यायकर्ता","रूथ","1 शमूएल","2 शमूएल","1 राजा","2 राजा","1 इतिहास","2 इतिहास","एज्रा","नहेम्याह","एस्तर","अय्यूब","भजनसंग्रह","हितोपदेश","उपदेशक","श्रेष्ठगीत","यशैया","यर्मिया","विलाप","इजकिएल","दानियल","होशे","योएल","आमोस","ओबदिया","योना","मीका","नहूम","हबकूक","सपन्याह","हाग्गै","जकरिया","मलाकी","मत्ती","मर्कूस","लूका","यूहन्ना","प्रेरित","रोमी","1 कोरिन्थी","2 कोरिन्थी","गलाती","एफिसी","फिलिप्पी","कलस्सी","1 थिस्सलोनिकी","2 थिस्सलोनिकी","1 तिमोथी","1 तिमोथी","तीतस","फिलेमोन","हिब्रू","याकूब","1 पत्रुस","2 पत्रुस","1 यूहन्ना","2 यूहन्ना","3 यूहन्ना","यहूदा","प्रकाश"
]);

//Oriya
bible.addNames("ori", bible.DEFAULT_BIBLE, [
"ଆଦିପୁସ୍ତକ","ଯାତ୍ରାପୁସ୍ତକ","ଲେବୀୟ ପୁସ୍ତକ","ଗଣନା ପୁସ୍ତକ","ଦ୍ୱିତୀୟ ବିବରଣ","ଯିହୋଶୂୟଙ୍କର ପୁସ୍ତକ","ବିଗ୍ଭରକର୍ତ୍ତାମାନଙ୍କ ବିବରଣ","ଋତର ବିବରଣ ପୁସ୍ତକ","ଶାମୁୟେଲଙ୍କ ପ୍ରଥମ ପୁସ୍ତକ","ଶାମୁୟେଲଙ୍କ ଦ୍ୱିତୀୟ ପୁସ୍ତକ","ରାଜାବଳୀର ପ୍ରଥମ ପୁସ୍ତକ","ରାଜାବଳୀର ଦ୍ୱିତୀୟ ପୁସ୍ତକ","ବଂଶାବଳୀର ପ୍ରଥମ ପୁସ୍ତକ","ବଂଶାବଳୀର ଦ୍ୱିତୀୟ ପୁସ୍ତକ","ଏଜ୍ରା","ନିହିମିୟାଙ୍କର ପୁସ୍ତକ","ଏଷ୍ଟର ବିବରଣ","ଆୟୁବ ପୁସ୍ତକ","ଗୀତସଂହିତା","ହିତୋପଦେଶ","ଉପଦେଶକ","ପରମଗୀତ","ଯିଶାଇୟ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କର ପୁସ୍ତକ","ଯିରିମିୟ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ଯିରିମିୟଙ୍କ ବିଳାପ","ଯିହିଜିକଲ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ଦାନିୟେଲଙ୍କ ପୁସ୍ତକ","ହୋଶେୟ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ଯୋୟେଲ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ଆମୋଷ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ଓବଦିଅ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ଯୂନସ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ମୀଖା ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ନାହୂମ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ହବ‌କ୍‌କୂକ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ସିଫନିୟ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ହାଗୟ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ଯିଖରିୟ ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ମଲାଖି ଭବିଷ୍ୟ‌ଦ୍‌ବକ୍ତାଙ୍କ ପୁସ୍ତକ","ମାଥିଉ ଲିଖିତ ସୁସମାଗ୍ଭର","ମାର୍କ ଲିଖିତ ସୁସମାଗ୍ଭର","ଲୂକ ଲିଖିତ ସୁସମାଗ୍ଭର","ଯୋହନ ଲିଖିତ ସୁସମାଗ୍ଭର","ପ୍ରେରିତମାନଙ୍କ କାର୍ଯ୍ୟର ବିବରଣ","ରୋମୀୟଙ୍କ ପ୍ରତି ପତ୍ର","କରିନ୍ଥୀୟଙ୍କ ପ୍ରତି ପ୍ରଥମ ପତ୍ର","କରିନ୍ଥୀୟଙ୍କ ପ୍ରତି ଦ୍ୱିତୀୟ ପତ୍ର","ଗାଲାତୀୟଙ୍କ ପ୍ରତି ପତ୍ର","ଏଫିସୀୟଙ୍କ ପ୍ରତି ପତ୍ର","ଫିଲି‌ପ୍‌ପୀୟଙ୍କ ପ୍ରତି ପତ୍ର","କଲସୀୟଙ୍କ ପ୍ରତି ପତ୍ର","ଥେସଲନୀକୀୟଙ୍କ ପ୍ରତି ପ୍ରଥମ ପତ୍ର","ଥେସଲନୀକୀୟଙ୍କ ପ୍ରତି ଦ୍ୱିତୀୟ ପତ୍ର","ତୀମଥିଙ୍କ ପ୍ରତି ପ୍ରଥମ ପତ୍ର","ତୀମଥିଙ୍କ ପ୍ରତି ଦ୍ୱିତୀୟ ପତ୍ର","ତୀତସଙ୍କ ପ୍ରତି ପତ୍ର","ଫିଲୀମୋନଙ୍କ ପ୍ରତି ପତ୍ର","ଏବ୍ରୀ","ଯାକୁବଙ୍କ ପତ୍ର","ପିତରଙ୍କ ପ୍ରଥମ ପତ୍ର","ପିତରଙ୍କ ଦ୍ୱିତୀୟ ପତ୍ର","ଯୋହନଙ୍କ ପ୍ରଥମ ପତ୍ର","ଯୋହନଙ୍କ ଦ୍ୱିତୀୟ ପତ୍ର","ଯୋହନଙ୍କ ତୃତୀୟ ପତ୍ର","ଯିହୂଦାଙ୍କ ପତ୍ର","ଯୋହନଙ୍କ ପ୍ରତି ପ୍ରକାଶିତ ବାକ୍ୟn"
]);

//Punjabi
bible.addNames("pan", bible.DEFAULT_BIBLE, [
"ਉਤਪਤ","ਕੂਚ","ਲੇਵੀਆਂ","ਗਿਣਤੀ","ਬਿਵਸਥਾ","ਯਹੋਸ਼ੁਆ","ਨਿਆਂਈਆਂ","ਰੂਥ","1 ਸਮੂਏਲ","2 ਸਮੂਏਲ","1 ਰਾਜਿਆਂ","2 ਰਾਜਿਆਂ","1 ਇਤਹਾਸ","2 ਇਤਹਾਸ","ਅਜ਼ਰਾ","ਨਹਮਯਾਹ","ਅਸਤਰ","ਅੱਯੂਬ","ਜ਼ਬੂਰ","ਕਹਾਉਤਾਂ","ਉਪਦੇਸ਼ਕ","ਸਲੇਮਾਨ","ਯਸਾਯਾਹ","ਯਿਰਮਿਯਾਹ","ਵਿਰਲਾਪ","ਹਿਜ਼ਕੀਏਲ","ਦਾਨੀਏਲ","ਹੋਸ਼ੇਆ","ਯੋਏਲ","ਆਮੋਸ","ਓਬਦਯਾਹ","ਯੂਨਾਹ","ਮੀਕਾਹ","ਨਹੂਮ","ਹਬਕੱੂਕ","ਸਫ਼ਨਯਾਹ","ਹੱਜਈ","ਜ਼ਕਰਯਾਹ","ਮਲਾਕੀ","ਮੱਤੀ","ਮਰਕੁਸ","ਲੂਕਾ","ਯੂਹੰਨਾ","ਰਸੂਲਾਂ","ਰੋਮੀਆਂ","1 ਕੁਰਿੰਥੀਆਂ","2 ਕੁਰਿੰਥੀਆਂ","ਗਲਾਤੀਆਂ","ਅਫ਼ਸੀਆਂ","ਫ਼ਿਲਿੱਪੀਆਂ","ਕੁਲੁੱਸੀਆਂ","1 ਥੱਸਲੁਨੀਕੀਆਂ","2 ਥੱਸਲੁਨੀਕੀਆਂ","1 ਤਿਮੋਥਿਉਸ","2 ਤਿਮੋਥਿਉਸ","ਤੀਤੁਸ","ਫ਼ਿਲੇਮੋਨ","ਇਬਰਾਨੀਆਂ","ਯਾਕੂਬ","1 ਪਤਰਸ","2 ਪਤਰਸ","1 ਯੂਹੰਨਾ","2 ਯੂਹੰਨਾ","3 ਯੂਹੰਨਾ","ਯਹੂਦਾਹ","ਪਰਕਾਸ਼n"
]);

//Persian
bible.addNames("pes", bible.DEFAULT_BIBLE, [
"پيدايش","سفر خروج","لاويان","اعداد","تثنييه","يشوع","داوران","روت","اول سموئيل","دوم سموئيل","اول پادشاهان","دوم پادشاهان","اول تواريخ","دوم تواريخ","عزرا","نحيميا","استر","ايوب","مزامير","امثال","جامعه","غزلی از غزلها","اشعيا","ارمييا","نوحه","حزقيال","دانيال","هوزيا","يوئيل","عاموس","عوبيديا","يونس","ميکاه","ناحوم","حبقوق","ضفينيا","حجی","زکريا","ملاکی","متی","مرقس","لوقا","يوحنا","اعمال رسولان","روميان","اول قرنتيان","دوم قرنتيان","غلاطيان","افسسيان","فيليپيان","کولوسيان","اول تسالونيکيان","دوم تسالونيکيان","اول تيموتيوس","دوم تيموتيوس","تايتوس","فيلمان","عبرانيان","يعقوب","اول پترس","دوم پترس","اول يوحنا","دوم يوحنا","سوم يوحنا","يهودا","مکاشفهn"
]);

// Russian
bible.addNames('rus', bible.DEFAULT_BIBLE, [
	"Бытие","Исход","Левит","Числа","Второзаконие","Иисус Навин","Книга Судей","Руфь","1-я Царств","2-я Царств","3-я Царств","4-я Царств","1-я Паралипоменон","2-я Паралипоменон","Ездра","Неемия","Есфирь","Иов","Псалтирь","Притчи","Екклесиаст","Песни Песней","Исаия","Иеремия","Плач Иеремии","Иезекииль","Даниил","Осия","Иоиль","Амос","Авдия","Иона","Михей","Наум","Аввакум","Софония","Аггей","Захария","Малахия","От Матфея","От Марка","От Луки","От Иоанна","Деяния","К Римлянам","1-е Коринфянам","2-е Коринфянам","К Галатам","К Ефесянам","К Филиппийцам","К Колоссянам","1-е Фессалоникийцам","2-е Фессалоникийцам","1-е Тимофею","2-е Тимофею","К Титу","К Филимону","К Евреям","Иакова","1-e Петра","2-e Петра","1-e Иоанна","2-e Иоанна","3-e Иоанна","Иуда","Откровение"
]);

// Spanish
bible.addNames("spa", bible.DEFAULT_BIBLE, [
	"Génesis","Exodo","Levítico","Números","Deuteronomio","Josué","Jueces","Rut","1 Samuel","2 Samuel","1 Reyes","2 Reyes","1 Crónicas","2 Crónicas","Esdras","Nehemías","Ester","Job","Salmos","Proverbios","Eclesiastés","Cantares","Isaías","Jeremías","Lamentaciones","Ezequiel","Daniel","Oseas","Joel","Amós","Abdías","Jonás","Miqueas","Nahúm","Habacuc","Sofonías","Hageo","Zacarías","Malaquías","Mateo","Marcos","Lucas","Juan","Hechos","Romanos","1 Corintios","2 Corintios","Gálatas","Efesios","Filipenses","Colosenses","1 Tesalonicenses","2 Tesalonicenses","1 Timoteo","2 Timoteo","Tito","Filemón","Hebreos","Santiago","1 Pedro","2 Pedro","1 Juan","2 Juan","3 Juan","Judas","Apocalipsis"
]);

// Tamil
bible.addNames("tam",bible.DEFAULT_BIBLE,[
"ஆதியாகமம்","யாத்திராகமம்","லேவியராகமம்","எண்ணாகமம்","உபாகமம்","யோசுவா","நியாயாதிபதிகள்","ரூத்","1 சாமுவேல்","2 சாமுவேல்","1 இராஜாக்கள்","2 இராஜாக்கள்","1 நாளாகமம்","2 நாளாகமம்","எஸ்றா","நெகேமியா","எஸ்தர்","யோபு","சங்கீதம்","நீதிமொழிகள்","பிரசங்கி","உன்னதப்பாட்டு","ஏசாயா","எரேமியா","புலம்பல்","எசேக்கியேல்","தானியேல்","ஓசியா","யோவேல்","ஆமோஸ்","ஒபதியா","யோனா","மீகா","நாகூம்","ஆபகூக்","செப்பனியா","ஆகாய்","சகரியா","மல்கியா","மத்தேயு","மாற்கு","லூக்கா","யோவான்","அப்போஸ்தலர்","ரோமர்","1 கொரி.","2 கொரி.","கலாத்தியர்","எபேசியர்","பிலிப்பியர்","கொலோசெயர்","1 தெசலோனிக்கேயர்","2 தெசலோனிக்கேயர்","1 தீமோத்தேயு","2 தீமோத்தேயு","தீத்து","பிலேமோன்","எபிரேயர்","யாக்கோபு","1 பேதுரு","2 பேதுரு","1 யோவான்","2 யோவான்","3 யோவான்","யூதா","வெளி"
]);

// Telugu
bible.addNames("tel",bible.DEFAULT_BIBLE,[
"ఆదికాండము","నిర్గమకాండము","లేవీయకాండము","సంఖ్యాకాండము","ద్వితీయోపదేశకాండము","యెహొషువ","న్యాయాధిపతులు","రూతు","సమూయేలు మొదటి గ్రంథము","సమూయేలు రెండవ గ్రంథము","రాజులు మొదటి గ్రంథము","రాజులు రెండవ గ్రంథము","దినవృత్తాంతములు మొదటి గ్రంథము","దినవృత్తాంతములు రెండవ గ్రంథము","ఎజ్రా","నెహెమ్యా","ఎస్తేరు","యోబు గ్రంథము","కీర్తనల గ్రంథము","సామెతలు","ప్రసంగి","పరమగీతము","యెషయా గ్రంథము","యిర్మీయా","విలాపవాక్యములు","యెహెజ్కేలు","దానియేలు","హొషేయ","యోవేలు","ఆమోసు","ఓబద్యా","యోనా","మీకా","నహూము","హబక్కూకు","జెఫన్యా","హగ్గయి","జెకర్యా","మలాకీ","మత్తయి సువార్త","మార్కు సువార్త","లూకా సువార్త","యోహాను సువార్త","అపొస్తలుల కార్యములు","రోమీయులకు","I కొరింథీయులకు","II కొరింథీయులకు","గలతీయులకు","ఎఫెసీయులకు","ఫిలిప్పీయులకు","కొలొస్సయులకు","I థెస్సలొనీకయులకు","II థెస్సలొనీకయులకు","I తిమోతికి","II తిమోతికి","తీతుకు","ఫిలేమోనుకు","హెబ్రీయులకు","యాకోబు","I పేతురు","II పేతురు","I యోహాను","II యోహాను","III యోహాను","యూదా","ప్రకటన గ్రంథముn"
]);

// Turkish
bible.addNames('tur', bible.DEFAULT_BIBLE, [["Yaratilis", "Tekvin"],["Misir'dan Çikis", "Çikis"],"Levililer",["Çölde Sayim", "Sayilar"],"Yasa'nin Tekrari","Yesu","Hakimler","Rut","1 Samuel","2 Samuel","1 Krallar","2 Krallar","1 Tarihler","2 Tarihler","Ezra","Nehemya","Ester",["Eyüp", "Eyub"],"Mezmurlar",["Süleyman'in Özdeyisleri", "Süleyman'in Meselleri"],"Vaiz",["Ezgiler Ezgisi", "Nesideler Nesidesi"],["Yesaya", "Isaya"],"Yeremya",["Agitlar", "Yeremya'nin Mersiyeleri"],"Hezekiel","Daniel","Hosea","Yoel","Amos",["Ovadya", "Obadya"],"Yunus","Mika","Nahum","Habakkuk",["Sefanya", "Tsefanya"],["Hagay", "Haggay"],["Zekeriya", "Zekarya"],"Malaki","Matta","Markos","Luka","Yuhanna",["Elçilerin Isleri", "Resullerin Isleri"],"Romalilar",["1 Korintliler", "1. Korintoslular"],["2 Korintliler", "2. Korintoslular"],"Galatyalilar",["Efesliler", "Efesoslular"],"Filipililer","Koloseliler","1 Selanikiler","2 Selanikiler","1 Timoteos","2 Timoteos","Titus","Filimon","Ibraniler",["Yakup", "Yakub"],"1 Petrus","2 Petrus","1 Yuhanna","2 Yuhanna","3 Yuhanna","Yahuda","Vahiy"
]);

//Urdu
bible.addNames("urd",bible.DEFAULT_BIBLE,[
"پَیدایش","خُرُوج","احبار","گِنتی","اِستِثنا","یشُوع","قُضاۃ","رُوت","۱-سموئیل","۲-سموئیل","۱-سلاطِین","۲-سلاطِین","۱-توارِیخ","۲- توارِیخ","عزرا","نحمیاہ","آستر","ایُّوب","زبُو","امثال","واعِظ","غزلُ الغزلات","یسعیاہ","یرمِیاہ","نَوحہ","حِزقی ایل","دانی ایل","ہوسیعَِ","یُوایل","عامُوس","عبدیاہ","یُوناہ","مِیکاہ","ناحُوم","حبقُّوق","صفنیاہ","حجَّی","زکریاہ","ملاکی","متّی","مرقس","لُوقا","یُوحنّا","اَعمال","رُومِیوں","۱-کُرِنتھِیوں","۲-کُرِنتھِیوں","گلتِیوں","اِفسِیوں","فِلپّیوں","کُلسِیوں","۱-تھِسّلُنیکیوں","۲-تھِسّلُنیکیوں","۱-تِیمُتھِیُس","۲-تِیمُتھِیُس","طِطُس","فِلیمون","عِبرانیوں","یعقُوب","۱-پطرس","۲-پطرس","۱-یُوحنّا","۲-یُوحنّا","۳-یُوحنّا","یہُوداہ","مُکاشفہ"
]);

//Vietnamese
bible.addNames("vie",bible.DEFAULT_BIBLE,[
"Sáng Thế Ký","Xuất Ai Cập Ký","Lê-vi Ký","Dân Số Ký","Phục Truyền Luật Lệ Ký","Giô-suê","Các Quan Xét","Ru-tơ","I Sa-mu-ên","II Sa-mu-ên","I Các Vua","II Các Vua","I Sử Ký","II Sử Ký","E-xơ-ra","Nê-hê-mi","Ê-xơ-tê","Gióp","Thi Thiên","Châm Ngôn","Truyền Đạo","Nhã Ca","Ê-sai","Giê-rê-mi","Ca Thương","Ê-xê-chi-ên","Đa-ni-ên","Ô-sê","Giô-ên","A-mốt","Áp-đia","Giô-na","Mi-chê","Na-hum","Ha-ba-cúc","Sô-phô-ni","A-ghê","Xa-cha-ri","Ma-la-chi","Ma-thi-ơ","Mác","Lu-ca","Giăng","Công Vụ Các Sứ Đồ","Rô-ma","I Cô-rinh-tô","II Cô-rinh-tô","Ga-la-ti","Ê-phê-sô","Phi-líp","Cô-lô-se","I Tê-sa-lô-ni-ca","II Tê-sa-lô-ni-ca","I Ti-mô-thê","II Ti-mô-thê","Tít","Phi-lê-môn","Hê-bơ-rơ","Gia-cơ","I Phi-e-rơ","II Phi-e-rơ","I Giăng","II Giăng","III Giăng","Giu-đe","Khải Huyền"
]);